# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# darknet53 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, nn.Conv2d, [64, 7, 2, 3]],  # 0
   [-1, 1, nn.BatchNorm2d, [None]],  # 1-P1/2
   [-1, 1, nn.ReLU, [True]],
   [-1, 1, nn.MaxPool2d, [3, 2, 1]],  # 3-P2/4
   [-1, 3, resLayer, [64, 1, 1, 64, True]],
   [-1, 4, resLayer, [128, 2, 1, 64, True]],  # 5-P3/8
   [-1, 6, resLayer, [256, 2, 1, 64, True]],
   [-1, 3, resLayer, [512, 2, 1, 64, True]],  # 7-P4/16
  ]

# YOLOv3 head
head:
  [
   [-1, 1, Bottleneck, [1024, False]],
   [-1, 1, Conv, [512, [1, 1]]],
   [-1, 1, Conv, [1024, 3, 1]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [1024, 3, 1]],  # 12 (P5/32-large)
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Bottleneck, [512, False]],
   [-1, 1, Bottleneck, [512, False]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]],  # 19 (P4/16-medium)

   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, Bottleneck, [256, False]],
   [-1, 2, Bottleneck, [256, False]],  # 24 (P3/8-small)

   [[24, 19, 12], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
